//-------------------------------------------------------------------------------------------------------------
//=======================ЗАДАНИЕ СЕМИНАРА====ЗАДАНИЕ СЕМИНАРА====ЗАДАНИЕ СЕМИНАРА==============================
//-------------------------------------------------------------------------------------------------------------

/* Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.

int GetSum(int a)
{
    int sum = 0;
    
    for(int current = 1; current <= a; current++)
        sum += current;
    return sum;
}
Console.Write("Введи число A: ");
int number =  Convert.ToInt32(Console.ReadLine());

int result = GetSum(number);
Console.WriteLine($"Число от 1 до {number} Сумма состоавляет: {result}");

// Вариант 2: 

// Console.Write("Введи число A: ");
// int number =  Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Число от 1 до N = "+ ((1 + number) * number)/2);

*/

//-------------------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------------------
//=======================ЗАДАНИЯ В ЗАЛАХ====ЗАДАНИЯ В ЗАЛАХ====ЗАДАНИЯ В ЗАЛАХ=================================
//-------------------------------------------------------------------------------------------------------------

/* Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.

int Digits(int num)
{
    int digits = 0;

    if(num == 0) 
        digits = 1;
    
    while (num != 0)
    {    
        num /= 10; //num = num / 10
        digits++;
    }

    return digits;
}

Console.Write("Введи число: ");
int number =  Convert.ToInt32(Console.ReadLine());

int dig = Digits(number);
Console.WriteLine($"В числе {number} содержится {dig} чисел");


// Console.Write("Введи число: ");
//     int Number = Convert.ToInt32(Console.ReadLine());
        
        // string NumberText = Convert.ToString(number);

        // Console.WriteLine("Кол-во чисел: " + NumberText.Length);

*/

//-------------------------------------------------------------------------------------------------------------

/* *Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.

Console.Write("Введи значение N: ");
    int Num =  Convert.ToInt16(Console.ReadLine());

Console.Write("Произведение чисел до N: ");
for (int i = 1; i < Num; i++)
{
    Console.Write((i++ * Num ) + " ");
}




Console.Write("Введи число A: ");
     int Num =  Convert.ToInt16(Console.ReadLine());

for (int i = Num; i-1 < Num; i++)

int i = num.ToString().Length;

Console.Write((i) + " ");

*/

//-------------------------------------------------------------------------------------------------------------
//=======================ДОМАШНЕЕ ЗАДАНИЯ====ДОМАШНЕЕ ЗАДАНИЯ====ДОМАШНЕЕ ЗАДАНИЯ==============================
//-------------------------------------------------------------------------------------------------------------

/* Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

Console.Write("Введи число A: ");
    int A =  Convert.ToInt16(Console.ReadLine());
Console.Write("Введи число B: ");
    int B =  Convert.ToInt16(Console.ReadLine());
    
    // Вариант 1: FOR ----------------------------------------
   
   int H = 1; 

for (int step1 = 0 ; step1 < B; step1++)
{ 
  H = H * A; 
}
Console.WriteLine("Вариант FOR: Число A = "+ A + " Число B = " + B +" Число А в степени B = "+H);

    // Вариант 2: WHILE --------------------------------------

int i = 0;          // назн. переменную i
int step = 1;       // назн. переменную step

while (i < B)       // проверка условия, цикл пока i меньше B, выполняется условие {}
    {
        i++ ;       // к i прибавляем 1
        step = step * A; 
       }

Console.WriteLine("Вариант While: Число A = "+ A + " Число B = " + B +" Число А в степени B = "+ step);

*/

//-------------------------------------------------------------------------------------------------------------
  
/* Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

Console.Write("Введи число: ");
int number =  Convert.ToInt32(Console.ReadLine());

int sum = (number % 10);         // переменная sum, которая берет остаток от деления на 10 введеного числа

int num = number / 10;          // переменна num делит число number на 10 временная для работы с числом

// на примере While
while (num > 0)                 // пока у нас num > 0 выполняем условия
{  
    sum = sum + num % 10;       // в переменную sum записываем значначения sum + остаток от деления на num
    num = num / 10;             // получаем num путем деления num на 10
}

// на примере for               // необходимо закоментить int num строка 140
// for (int  num = (number / 10); num > 0; num = num / 10)             // пока у нас num > 0 выполняем условия
// {  
//     sum = sum + num % 10;   // в переменную sum записываем значначения sum + остаток от деления на num
//                             // получаем num путем деления num на 10
// }

Console.WriteLine($"На примере While: В числе {number} сумма чисел равна {sum}"); // вывод значения
*/

//-------------------------------------------------------------------------------------------------------------

/* Задача 29: Напишите программу, которая задаёт массив из m элементов и выводит их на экран. 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19] // 6, 1, 33 -> [6, 1, 33]

Console.Write("Введите количество элементов массива': ");
    int size =  Convert.ToInt32(Console.ReadLine());

int[] newArray = CreateArray(size);
ShowArray(newArray);

int[] CreateArray(int size)
{
        int[] array = new int[size];                                // резерв место для массива под названием array (любое название) размером size

        for(int i = 0; i < size; i++)                                                                   
           {                                                        //array[i] = new Random().Next(minValue, maxValue + 1); 
            Console.Write("Введите значание': ");
        array[i] =  Convert.ToInt32(Console.ReadLine());
           }
        return array;
}

void ShowArray(int[] array)
{
        for(int i = 0; i < array.Length; i++)
            Console.Write(array[i] + " ");

         //   Console.WriteLine();
}
*/

//-------------------------------------------------------------------------------------------------------------